print("Та эртний агуйн гүнд сэрлээ. Харанхуйд нүд тань дасах үед урд тань хоёр зам харагдана.")
print("Нэг нь зүүн тийш, нөгөө нь баруун тийш чиглэжээ.")
way = input("Та аль замаар явах вэ? зүүн эсвэл баруун? ")

if way == "зүүн":
    print("Та зүүн замаар явсаар нэгэн чулуун хаалганы өмнө ирлээ.")
    print("Хаалган дээр 'Мөсөн дээр мөнгөн аяга тэр юу вэ?' гэсэн бичиг байна.")
    taawar = input("Та юу гэж хариулах вэ? ")

    if taawar == "сар":
        print("Хаалга аажуухан нээгдэж, та эрдэнэсээр дүүрэн өрөөнд орлоо. Та яллаа!")
        print("--- ТОГЛООМ ДУУСЛАА ---")
    else:
        print("Хаалга алга болон та бүтэлгүйтлээ.Та ялагдлаа.")
        print("--- ТОГЛООМ ДУУСЛАА ---")
elif way == "баруун":
    print("Та баруун замаар явтал урдаас тань луу гарч ирлээ!")
    print("Луу танаас 'Би юу бодож байна?' гэж асуув.")
    answer = input("Та юу гэж хариулах вэ? (унтах эсвэл идэх):")

    if  answer == "идэх":
        print("Луу уурлан, 'Буруу байна!' гээд таныг нэг үлээгээд л шатаачихав. Та ялагдлаа.")
        print("--- ТОГЛООМ ДУУСЛАА ---")
    elif answer == "унтах":
        print("Зөв тааж луу таныг буцаан явууллаа. Та буцан зүүн замаар явж эрдэнэс олон яллаа.")
        print("--- ТОГЛООМ ДУУСЛАА ---")
    else:
        print("Луу уурлан, 'Буруу байна!' гээд таныг нэг үлээгээд л шатаачихав. Та ялагдлаа.")
        print("--- ТОГЛООМ ДУУСЛАА ---")
else:
    print("Та буруу сонголт хийсэн тул хальтирч унан, харанхуй нүх рүү уналаа. Та ялагдлаа.")
    print("--- ТОГЛООМ ДУУСЛАА ---")